ws/request.xml

<soapenv:Envelope
   xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
   xmlns:gs="http://www.example.dev/springws">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getProjectRequest>
         <gs:id>1</gs:id>
         <gs:withEmployees>true</gs:withEmployees>
      </gs:getProjectRequest>
   </soapenv:Body>
</soapenv:Envelope>
